# GUID Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinition..::..GUID Property
ExternalDefinition Class See Also
---
Returns the GUID associated with the shared parameter definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Guid GUID { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property GUID As Guid
	Get
```

Visual C++
---
```text
public:
virtual property Guid GUID {
	Guid get ();
}
```

# Remarks
Each shared parameter when created is issued a unique identifier. This identifier can then be used at a later time to retrieve the parameter from the Element ensuring that the correct parameter is always retrieved.
# See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace